{
  "meta": {
    "source": "mosaic_testimonials.md",
    "generatedAt": "2025-11-17T13:15:00.000Z",
    "title": "Mosaic Testimonials",
    "subtitle": "Client & Volunteer Stories",
    "badgeLabel": "Testimonials",
    "bottomText": "95% client satisfaction rate"
  },
  "entries": [
    {
      "name": "Veronica Wright",
      "role": "Aged Care Client",
      "testimonial": "He is an excellent shopper — a true gentleman who always goes above and beyond. I would welcome him into my home any time."
    },
    {
      "name": "Peter Rochfort",
      "role": "Aged Care Client",
      "testimonial": "He helps with my groceries and even plays guitar for Peter, which brought back wonderful memories from his band days. We were joking that we should adopt him!"
    },
    {
      "name": "Mrs Jarvis (for Harold Jarvis)",
      "role": "Aged Care Family Member",
      "testimonial": "My scheduler is always cheerful, pleasant, and incredibly helpful every single time. Any change to Harold’s visits is always communicated clearly by phone or text."
    },
    {
      "name": "Rosa Mignanelli",
      "role": "Aged Care Client",
      "testimonial": "After I had a fall, my care support worker did everything she could to help — she was truly lovely. I was very grateful for her support."
    },
    {
      "name": "Eugen Kozic",
      "role": "Aged Care Client",
      "testimonial": "I’m very satisfied with my care support worker today and would love to have him back again."
    },
    {
      "name": "Marian Robinson",
      "role": "Aged Care Client",
      "testimonial": "I’m settling in well and feeling much better. I’m grateful for all the support provided — thank you for helping me through this transition."
    },
    {
      "name": "Jennifer Ruth Ransom",
      "role": "Aged Care Client",
      "testimonial": "I’m very happy with my care support worker and would love to have her support whenever possible. She’s been wonderful."
    },
    {
      "name": "Pamela June Mahoney",
      "role": "Aged Care Client",
      "testimonial": "Thank you so much for all the support. I’m very happy with the non-slip socks I received."
    },
    {
      "name": "Sabina Morgan",
      "role": "Aged Care Client",
      "testimonial": "My care worker was wonderful and I’m very happy with Mosaic’s support. I’m grateful for everything you’ve provided."
    },
    {
      "name": "Ronald Madge",
      "role": "Aged Care Client",
      "testimonial": "Ron has developed a wonderful rapport with his carer — they even enjoy playing soccer together in the park on sunny days. Since the carers have come into his life, his mind has been much more stimulated and his conversations more lively."
    },
    {
      "name": "Nadezhda Aubin",
      "role": "Settlement, Families & Communities Client",
      "testimonial": "Your centre supported us through a domestic violence situation and helped us organise everything we needed to survive. Elena has supported my family for over a year — she’s a blessing. Thank you for having such a wonderful specialist."
    },
    {
      "name": "Roger Turner",
      "role": "Aged Care Client",
      "testimonial": "I wanted to pass on how pleased I am with my care worker. She did a wonderful job and I’m grateful for her support."
    },
    {
      "name": "Jocelyn Dowding",
      "role": "Admin Services Client",
      "testimonial": "Your receptionist is always so pleasant and helpful on the phone. She makes every interaction easy."
    },
    {
      "name": "Nathan Truong",
      "role": "Settlement, Families & Communities Client",
      "testimonial": "Bronwyn’s empathy, patience, and dedication have made such a difference in my life. She listens without judgment, always advocates on my behalf, and has helped me feel respected and supported."
    },
    {
      "name": "Tara Tamanna",
      "role": "Settlement, Families & Communities Client",
      "testimonial": "Mosaic has been incredible in supporting my settlement journey, especially through my case worker. She helped us with housing, improving my resume, finding employment, and guided me both practically and emotionally."
    },
    {
      "name": "Ali",
      "role": "Settlement, Families & Communities Client",
      "testimonial": "Bronwyn has been amazing to work with — intelligent, professional, and always understanding what’s needed. We felt so comfortable and supported throughout."
    },
    {
      "name": "Terez Al Talli",
      "role": "Settlement, Families & Communities Client",
      "testimonial": "I’m very happy with Bronwyn’s help. She is respectful, caring, and adds great value to Mosaic."
    },
    {
      "name": "Joop de Wit",
      "role": "ACVVS Volunteer",
      "testimonial": "Volunteering has given me a sense of purpose since 1983 — it’s incredibly rewarding to help people in their own language and connect deeply with others. Over the years, these connections have become like an extended family to me, widening my world through culture, friendship, and shared experiences."
    },
    {
      "name": "Dennis Archibald",
      "role": "Volunteer Citizenship Test Tutor",
      "testimonial": "I love helping migrant refugees build a new life in Australia — it’s meaningful and fulfilling. As the child of migrants myself, I want newcomers to feel welcome and supported. Mosaic’s staff and volunteers have been wonderful to work with."
    },
    {
      "name": "Shani Herat Gunaratne",
      "role": "Volunteer Homework Centre Tutor",
      "testimonial": "Meeting the students and learning about their journeys has been inspiring — their resilience and can-do attitude amaze me. Watching them grow socially and academically is incredibly rewarding. As the child of immigrants, it’s meaningful to help them embrace life in Australia."
    },
    {
      "name": "Peter Cook",
      "role": "Volunteer Employment & Housing Mentor",
      "testimonial": "The Mosaic team is warm, supportive, and a joy to work with. I’ve met many grateful clients, and I hope my small contribution helps them build a new life here. Having struggled myself to establish a career decades ago, I feel compelled to support those with an even tougher path."
    },
    {
      "name": "Lizzie Evered",
      "role": "Citizenship Application Support Volunteer",
      "testimonial": "I enjoy helping people through what can be a stressful and complex process, and I’ve met so many wonderful people. I believe everyone has a responsibility to help where they can, and volunteering with Mosaic has been a truly meaningful experience."
    },
    {
      "name": "Bill Livingstone",
      "role": "ACVVS Volunteer",
      "testimonial": "I really enjoy the conversations I share during my visits — whether reminiscing about familiar places or chatting about current events, sport, or everyday life. Seeing how much people enjoy and engage in these moments reminds me how meaningful this volunteer work is."
    },
    {
      "name": "Gaylia Bigg",
      "role": "EALD Homework Centre Volunteer",
      "testimonial": "Volunteering at the Homework Centre allows me to use my teaching skills and support students as they gain confidence in language and maths. I’ve enjoyed working with the coordinator and volunteers, each bringing unique life experiences, and helping new arrivals while learning from their cultures has been fulfilling and fun."
    }
  ]
}